SPedt/src/Documents/Приходная/Приходная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Приходная</name>
  <registerRecords>InformationRegister.УдалитьПокупкиОтдельнымМестом</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыВПосылках</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиНаСкладе</registerRecords>
  <registerRecords>InformationRegister.СтатусыДоставкиСвернуто</registerRecords>
  <registerRecords>InformationRegister.ДанныеЗаказовСайт</registerRecords>
  <registerRecords>InformationRegister.ШтрафныеЗаказы</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн_Ошибки</registerRecords>
  <registerRecords>InformationRegister.ДанныеЗаказов</registerRecords>
  <registerRecords>InformationRegister.ОчередьРазбора</registerRecords>
  <registerRecords>InformationRegister.Обмен100сп</registerRecords>
  <registerRecords>AccumulationRegister.Транзит</registerRecords>
  <registerRecords>AccumulationRegister.НеВыгруженноНаСайт</registerRecords>
  <registerRecords>InformationRegister.УдалитьНегабаритЗначения</registerRecords>
  <registerRecords>InformationRegister.СтатусыДоставки</registerRecords>
  <registerRecords>InformationRegister.Обмен100спСообщения</registerRecords>
  <registerRecords>AccumulationRegister.Приход</registerRecords>
  <registerRecords>AccumulationRegister.КПолучению</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОборотнаяТараДвижение</registerRecords>
  <attributes>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Организаторы</types>
    </type>
  </attributes>
  <attributes>
    <name>Транзит</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктВыдачи</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>МультиОрг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыПриходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДелаемГрупповойСтикер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СвояТочка</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Покупки</name>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>Покупка</name>
      <comment>Номер покупки</comment>
      <type>
        <types>CatalogRef.Покупки</types>
        <types>CatalogRef.Заказы</types>
        <types>CatalogRef.Пристрой</types>
        <types>CatalogRef.СобранныеЗаказы</types>
        <types>Number</types>
        <types>CatalogRef.Коробки</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.Организаторы</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтдельнымМестом</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОргСбор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Оплачен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриема</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <comment>Размер покупки</comment>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>КодПокупки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Предупреждение</name>
      <type>
        <types>EnumRef.ПредупрежденияПрихода</types>
      </type>
    </attributes>
    <attributes>
      <name>Отправлено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Посылки</name>
    <attributes>
      <name>Посылка</name>
      <type>
        <types>CatalogRef.Посылки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктВыдачи</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриема</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтдельнымМестом</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отправлено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>Загружено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Оплачен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОборотнаяТара</name>
    <attributes>
      <name>Тара</name>
      <type>
        <types>CatalogRef.ОборотнаяТара</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктВыдачи</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SPedt/src/Catalogs/Участники/Участники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Участники</name>
  <predefined>
    <items>
      <name>нулевой</name>
      <description>NO_USER</description>
    </items>
  </predefined>
  <attributes>
    <name>Почта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонХэш</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рэйтинг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧерныйСписок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьВыдачу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьВыдачуКомментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧерныйСписокКомментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Догрузить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсегдаПечататьЧек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГородСП</name>
    <type>
      <types>CatalogRef.ГородаСП</types>
    </type>
  </attributes>
</mdclass:Catalog>

SPedt/src/Documents/Приходная/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
перем РежимЗаписи;
#Область ШтрихКоды

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// ПодключаемоеОборудование                
	Если 	ИмяСобытия 	= "ScanData" 					и
			Источник 	= "ПодключаемоеОборудование" 	и
			ВводДоступен()										Тогда
			
			ШК 			= СтоСП_Клиент.ПолучитьШКизПараметров(Параметр);
			ОбработатьШКнаКлиенте(ШК);
			
	КонецЕсли;
	// Конец ПодключаемоеОборудование
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШКнаКлиенте(ШК)
	ДанныеШК    = СП_Штрихкоды.ПолучитьДанныеПоШК(ШК);

	//Если не ЗначениеЗаполнено(объект.ПунктВыдачи) Тогда
	//	ДанныеШК.Свойство("ПунктВыдачи",объект.ПунктВыдачи);
		//Если Строка(ДанныеШК.ПунктВыдачи) = "Пунт выдачи не указан" Тогда
		//	ДанныеШК.ПунктВыдачи	
		//КонецЕсли;
	//КонецЕсли;	
	Если Строка(ДанныеШК.Тип) = "Посылка (12)"  		или
		 Строка(ДанныеШК.Тип) = "Покупка (11)" 			или 
		 Строка(ДанныеШК.Тип) = "Заказ100маркета (33)"	или
		 Строка(ДанныеШК.Тип) = "Заказ КД (45)"	или
		 Строка(ДанныеШК.Тип) = "Коробка (44)"					Тогда
		 
		 Если НеПриниматьТранзит и
			 ДанныеШК.ПунктВыдачи <> Объект.СвояТочка Тогда
			ПоказатьПредупреждение(,"Заказ " + ДанныеШК.Посылка + ", для пункта выдачи:" + ДанныеШК.ПунктВыдачи,20,"Транзитный заказ");
			Возврат;
		КонецЕсли;	
		ПроверитьПунктВыдачиИДобавитьЗаказ(ДанныеШК);
	Иначеесли Строка(ДанныеШК.Тип) = "Оборотная тара (34)" 			Тогда		
		//СтоСПОбмен_ОборотнаяТара.ДополнитьКоробкой(ДанныеШК);
		//Если ДанныеШК.Коробка = Неопределено Тогда
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определеноа коробка по таре: "+ ДанныеШК.ОбороткнаяТара);
		//	Возврат;
		//КонецЕсли;	
		Добавлено = ОбработатьШКОборотнойТры(ДанныеШК);
		Если Добавлено Тогда
			СтоСП_Клиент.СигналДинамика();
			Элементы.ГруппаСтраницы.ТекущаяСтраница	=	Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаОборотнаяТара;
		КонецЕсли;	
		
	Иначеесли Строка(ДанныеШК.Тип) = "Сотрудник (55)" 			Тогда	
		ЗакрыватьДокумент = (сред(шк,8,2) = "01");
		Если СП_РаботаСДокументами_Клиент.ЗаписатьДокумент(этотОбъект,,ДанныеШК.Сотрудник) и ЗакрыватьДокумент Тогда
			Закрыть();
		КонецЕсли;	
	ИначеЕсли Строка(ДанныеШК.Тип) = "Габарит (62)" 				Тогда	
		Габарит			= ДанныеШК.Габарит;
	ИначеЕсли Строка(ДанныеШК.Тип) = "Место хранения (63)" 		Тогда	
		МестоХранения	= ДанныеШК.МестоХранения;
	ИначеЕсли Строка(ДанныеШК.Тип) = "Действие по ШК (66)"  и ДанныеШК.Действие = "СнятьУстановитьОтдельнымМестом"	    Тогда		
		ОтдельнымМестом	=	не ОтдельнымМестом;
	ИначеЕсли Строка(ДанныеШК.Тип) = "Действие по ШК (66)"  и ДанныеШК.Действие = "Мультиорг"	    Тогда		
		Объект.МультиОрг	=	не Объект.МультиОрг;	
	иначе	
		
	КонецЕсли;
	Модифицированность			= Истина;
	УстановитьВидимость();
	ПересчетЗаголовковСтраниц();
КонецПроцедуры	


Функция ОбработатьШКОборотнойТры(ДанныеШК)
	Тара = ДанныеШК.ОборотнаяТара;
	ПунктВыдачи = Константы.ОборотнаяТараПунктВыдачи.Получить();
	Если не ЗначениеЗаполнено(ПунктВыдачи) Тогда
		
	КонецЕсли;
	найдено = Объект.ОборотнаяТара.НайтиСтроки(Новый Структура("Тара",Тара));
	Если найдено.Количество()= 0  Тогда
		новаяСтрока = Объект.ОборотнаяТара.Добавить();
		новаяСтрока.Тара 		= Тара;
		новаяСтрока.ПунктВыдачи = ПунктВыдачи;
		Возврат истина;	
	Иначе	
		Возврат Ложь;	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВвестиШтрихКодВручную(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаВводаШК",,ЭтотОбъект,,,,Новый ОписаниеОповещения("ВвестиШтрихКодВручную_Завершение", ЭтотОбъект));
	//12000008536904000077
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПунктВыдачи(Команда)
	Если Элементы.Посылки.ТекущиеДанные <> Неопределено Тогда
		параметрыФормы = новый Структура;
		параметрыФормы.Вставить("Посылка", 		   			Элементы.Посылки.ТекущиеДанные.Посылка); 
		параметрыФормы.Вставить("ДокументПоступления", 		Объект.Ссылка);               
		параметрыФормы.Вставить("ПунктВыдачиНаСтикере", 	Элементы.Посылки.ТекущиеДанные.ПунктВыдачи);               
		ОткрытьФорму("ОбщаяФорма.ФормаВыбораПунктаВыдачи", 	параметрыФормы ,ЭтотОбъект,,,,Новый ОписаниеОповещения("ВыбратьПунктВыдачи_Завершение", ЭтотОбъект, параметрыФормы), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПунктВыдачи_Завершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	СП_РаботаСоСправочниками.ОбновитьПосылку(ДополнительныеПараметры.Посылка, новый Структура("ПунктВыдачи", ВыбранноеЗначение));
	Если Элементы.Посылки.ТекущиеДанные<>Неопределено и Элементы.Посылки.ТекущиеДанные.ПунктВыдачи <> ВыбранноеЗначение Тогда
		Элементы.Посылки.ТекущиеДанные.ПунктВыдачи = ВыбранноеЗначение;
	КонецЕсли;
	СП_РаботаСДокументами_Клиент.ЗаписатьДокумент(ЭтотОбъект);
	Если Элементы.Посылки.ТекущиеДанные<>неопределено Тогда
		ОповеститьОбИзменении(Элементы.Посылки.ТекущиеДанные.Посылка);
	КонецЕсли;
КонецПроцедуры	


&НаКлиенте
Процедура ВвестиШтрихКодВручную_Завершение(ШК, ДополнительныеПараметры) Экспорт
	ОбработатьШКнаКлиенте(ШК);
КонецПроцедуры	

#КонецОбласти


Функция РазрешеноПриниматьНаПунктВыдачи(ПунктВыдачи)
	мТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	Если 	КонтролироватьПунктыВыдачи и
			мТекущийПользователь.ТочкиПриема.Количество()>0 и
			мТекущийПользователь.ТочкиПриема.НайтиСтроки(новый структура("ТочкаРаздачи",ПунктВыдачи)).Количество()=0
		Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Текущий пользователь не может принимать покупки на пункт выдачи: "+ПунктВыдачи);
		ПроверкаПройдена = Ложь;
	Иначе	
		ПроверкаПройдена = Истина;
	КонецЕсли;	
	возврат ПроверкаПройдена;
КонецФункции	


#Область ДобавлениеЗаказа

Функция ПередДобавлениемЗаказа(ПараметрыЗаказа)
	ПроверкаПройдена=Истина;

	Если  НЕ ЗначениеЗаполнено(Габарит) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выбрать Габарит",,"Габарит");
		ПроверкаПройдена	= Ложь;
	КонецЕсли;	
	
	Если  НЕ ЗначениеЗаполнено(МестоХранения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выбрать место хранения",,"МестоХранения",);
		ПроверкаПройдена	= Ложь;
	Иначе
		//Если 	  Константы.ИспользоватьБуффернуюЗону.Получить() 
		//		и не МестоХранения.БуфенаяЗона
		//		и ПараметрыЗаказа.ПунктВыдачи.ПроизводитсяОтгрузка Тогда
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Производится отгрузка на пункт выдачи " + ПараметрыЗаказа.ПунктВыдачи);
		//	ПроверкаПройдена	= Ложь;
		//КонецЕсли;
	КонецЕсли;


	Возврат ПроверкаПройдена;
КонецФункции

Функция ДобавитьПосылку(ПараметрыПосылки)
	Посылка 			= ПараметрыПосылки.Посылка;



	
	Если не ЗначениеЗаполнено(Объект.ПунктВыдачи) Тогда
		Объект.ПунктВыдачи	 	= Посылка.ПунктВыдачи;
		Объект.Транзит 			= (Объект.ПунктВыдачи <> Объект.СвояТочка);
	КонецЕсли;	
	Если не ЗначениеЗаполнено(Объект.Организатор) тогда
		Объект.Организатор		= Посылка.Организатор;
	КонецЕсли;


	
	ПроверкаПройдена	= ПередДобавлениемЗаказа(параметрыПосылки);


	масс_строк	= Объект.Посылки.НайтиСтроки(новый Структура("Посылка",Посылка));
	Если масс_строк.Количество()>0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Посылка "+Посылка+" уже добавлена ",,"Габарит");
		ПроверкаПройдена	= Ложь;
	КонецЕсли;	
	
	
	Если не	РазрешеноПриниматьНаПунктВыдачи(Посылка.ПунктВыдачи)		Тогда
		ПроверкаПройдена = Ложь;
	КонецЕсли;	
	
	
	Если не ПроверкаПройдена Тогда Возврат Ложь; КонецЕсли;
	

	
	новая_строка				= Объект.Посылки.Добавить();
	новая_строка.Посылка	 	= Посылка;
	Если Строка(Посылка.ПунктВыдачи) =  "Пунт выдачи не указан" Тогда
		новая_строка.ПунктВыдачи	= ПараметрыПосылки.ПунктВыдачи;
	Иначе	
		новая_строка.ПунктВыдачи	= Посылка.ПунктВыдачи;
	КонецЕсли;		
	новая_строка.ОтдельнымМестом= ОтдельнымМестом;
	новая_строка.Оплачен		= Оплачен;
	//Умолчания					= аСПНаСервере.ПолучитьЗначенияПоУмолчанию(Посылка.ПунктВыдачи,Ложь);
	
	новая_строка.Габарит		= Габарит;
	новая_строка.МестоХранения	= МестоХранения;

	
	новая_строка.Вес			= Вес;
	новая_строка.объем			= объем;
	новая_строка.ДатаПриема		= ТекущаяДата();
	новая_строка.ШК				= Посылка.ШК;
	Возврат Истина;
КонецФункции

Функция ДобавитьСтарыйЗаказ(параметрыПосылки)
	Если не ЗначениеЗаполнено(Объект.ПунктВыдачи) Тогда
		Объект.ПунктВыдачи	 	= параметрыПосылки.ПунктВыдачи;
		Объект.Транзит 			= (Объект.ПунктВыдачи <> Объект.СвояТочка);
	КонецЕсли;	
	Если не ЗначениеЗаполнено(Объект.Организатор) тогда
		Объект.Организатор		= параметрыПосылки.Организатор;
	КонецЕсли;
	
	
	ПроверкаПройдена	= ПередДобавлениемЗаказа(параметрыПосылки);
	
	Если  параметрыПосылки.Участник.ЧерныйСписок Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Участник:"+параметрыПосылки.Участник+"находится в черном списке",,"Габарит");
		ПроверкаПройдена	= Ложь;
	КонецЕсли;	
	
	Если  параметрыПосылки.НеПринимать Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Участник:"+параметрыПосылки.Участник+"находится в группе ""Не принимать""",,"Габарит");
		ПроверкаПройдена	= Ложь;
	КонецЕсли;	
	
	масс_строк	=	Объект.Покупки.НайтиСтроки(новый Структура("Покупка, Участник",параметрыПосылки.Покупка, параметрыПосылки.Участник));
	Если масс_строк.Количество()>0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заказ "+параметрыПосылки.Участник+символы.ПС+
															  ", "+параметрыПосылки.Покупка+символы.ПС+ 
															  " уже добавлен. ",,"Габарит");
		ПроверкаПройдена	= Ложь;
	КонецЕсли;	
	
	Если не	РазрешеноПриниматьНаПунктВыдачи(параметрыПосылки.ПунктВыдачи)		Тогда
		ПроверкаПройдена = Ложь;
	КонецЕсли;	

	
	Если не ПроверкаПройдена Тогда Возврат Ложь; КонецЕсли;
	

	новая_строка					= Объект.Покупки.Добавить();
	
	новая_строка.Участник			= параметрыПосылки.Участник;
	новая_строка.Покупка			= параметрыПосылки.Покупка;
	новая_строка.Организатор		= параметрыПосылки.Организатор;
	новая_строка.ОтдельнымМестом	= ОтдельнымМестом;
	новая_строка.ОргСбор			= ОргСбор;
	новая_строка.Оплачен			= Оплачен;
	новая_строка.вес				= Вес;
	новая_строка.объем				= объем;
	новая_строка.количество			= 1;
	новая_строка.ДатаПриема			= ТекущаяДата();
	новая_строка.ШК					= параметрыПосылки.ШК;
	новая_строка.КодПокупки			= параметрыПосылки.Покупка.Код;
	
	//Умолчания						= аСПНаСервере.ПолучитьЗначенияПоУмолчанию(параметрыПосылки.ПунктВыдачи,Ложь);
	//Если Константы.ВыбиратьГабаритПоТОчкеНазначения.Получить() и 
	//	параметрыПосылки.ПунктВыдачи <> Объект.СвояТочка   Тогда
	//	новая_строка.Габарит		= ?(ЗначениеЗаполнено(Умолчания.Габарит),		Умолчания.Габарит,			Габарит);
	//	новая_строка.МестоХранения	= ?(ЗначениеЗаполнено(Умолчания.МестоХранения),	Умолчания.МестоХранения,	МестоХранения);
	//Иначе	
		новая_строка.Габарит		= Габарит;
		новая_строка.МестоХранения	= МестоХранения;
	//КонецЕсли;		
	
	Возврат Истина;
КонецФункции


Функция ДобавитьЗаказКД(параметрыПосылки)
	Если не ЗначениеЗаполнено(Объект.ПунктВыдачи) Тогда
		Объект.ПунктВыдачи	 	= параметрыПосылки.ПунктВыдачи;
		Объект.Транзит 			= (Объект.ПунктВыдачи <> Объект.СвояТочка);
	КонецЕсли;	
	Если не ЗначениеЗаполнено(Объект.Организатор) тогда
		Объект.Организатор		= Справочники.Организаторы.нулевой;
	КонецЕсли;
	
	ПроверкаПройдена	= ПередДобавлениемЗаказа(параметрыПосылки);
	масс_строк	=	Объект.Покупки.НайтиСтроки(новый Структура("Покупка",параметрыПосылки.заказ));
	Если масс_строк.Количество()>0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заказ "+параметрыПосылки.Заказ+" уже добавлен. ",,"Габарит");
		ПроверкаПройдена	= Ложь;
	КонецЕсли;	
	
	Если не	РазрешеноПриниматьНаПунктВыдачи(параметрыПосылки.ПунктВыдачи)		Тогда
		ПроверкаПройдена = Ложь;
	КонецЕсли;	
	
	

	
	Если не ПроверкаПройдена Тогда Возврат Ложь; КонецЕсли;
	

	новая_строка					= Объект.Покупки.Добавить();
	
	новая_строка.Участник			= Справочники.Участники.нулевой;
	новая_строка.Покупка			= параметрыПосылки.Заказ;
	новая_строка.Организатор		= Справочники.Организаторы.нулевой;
	новая_строка.ОтдельнымМестом	= ОтдельнымМестом;
	новая_строка.ОргСбор			= ОргСбор;
	новая_строка.Оплачен			= Оплачен;
	новая_строка.вес				= Вес;
	новая_строка.объем				= объем;
	новая_строка.количество			= 1;
	новая_строка.ДатаПриема			= ТекущаяДата();
	новая_строка.ШК					= параметрыПосылки.ШК;
	новая_строка.КодПокупки			= параметрыПосылки.Заказ.Код;
	
	//Умолчания						= аСПНаСервере.ПолучитьЗначенияПоУмолчанию(параметрыПосылки.ПунктВыдачи,Ложь);
	//Если Константы.ВыбиратьГабаритПоТОчкеНазначения.Получить() и 
	//	параметрыПосылки.ПунктВыдачи <> Объект.СвояТочка   Тогда
	//	новая_строка.Габарит		= ?(ЗначениеЗаполнено(Умолчания.Габарит),		Умолчания.Габарит,			Габарит);
	//	новая_строка.МестоХранения	= ?(ЗначениеЗаполнено(Умолчания.МестоХранения),	Умолчания.МестоХранения,	МестоХранения);
	//Иначе	
		новая_строка.Габарит		= Габарит;
		новая_строка.МестоХранения	= МестоХранения;
	//КонецЕсли;		
	
	Возврат Истина;
КонецФункции


Функция ДобавитьГруппу(параметрыПосылки)
	Если не ЗначениеЗаполнено(Объект.ПунктВыдачи) Тогда
		Объект.ПунктВыдачи	 	= параметрыПосылки.ПунктВыдачи;
		Объект.Транзит 			= (Объект.ПунктВыдачи <> Объект.СвояТочка);
	КонецЕсли;	
	Если не ЗначениеЗаполнено(Объект.Организатор) тогда
		Объект.Организатор		= параметрыПосылки.Организатор;
	КонецЕсли;
	
	ПроверкаПройдена	= ПередДобавлениемЗаказа(параметрыПосылки);
	
	Если не Объект.Транзит Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя принимать коробки на склад. Воспользуйтесь документом ""Разбор коробки"", либо установите переключатель ""Транзит"" ");
		ПроверкаПройдена	= Ложь;
	ИначеЕсли параметрыПосылки.КРазбору Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Это не транзитный заказ. Воспользуйтесь документом ""Разбор коробки"".");
		ПроверкаПройдена	= Ложь;
	КонецЕсли;	

	масс_строк	=	Объект.Покупки.НайтиСтроки(новый Структура("Покупка, Участник",параметрыПосылки.Коробка, Справочники.Участники.нулевой));
	Если масс_строк.Количество()>0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Коробка "+параметрыПосылки.Коробка+" уже добавлена. ",,"Габарит");
		ПроверкаПройдена	= Ложь;
	КонецЕсли;	
	
	Если не	РазрешеноПриниматьНаПунктВыдачи(параметрыПосылки.ПунктВыдачи)		Тогда
		ПроверкаПройдена = Ложь;
	КонецЕсли;	
	
	

	
	Если не ПроверкаПройдена Тогда Возврат Ложь; КонецЕсли;
	

	новая_строка					= Объект.Покупки.Добавить();
	
	новая_строка.Участник			= Справочники.Участники.нулевой;
	новая_строка.Покупка			= параметрыПосылки.Коробка;
	новая_строка.Организатор		= параметрыПосылки.Организатор;
	новая_строка.ОтдельнымМестом	= ОтдельнымМестом;
	новая_строка.ОргСбор			= ОргСбор;
	новая_строка.Оплачен			= Оплачен;
	новая_строка.вес				= Вес;
	новая_строка.объем				= объем;
	новая_строка.количество			= параметрыПосылки.Количество;
	новая_строка.ДатаПриема			= ТекущаяДата();
	новая_строка.ШК					= параметрыПосылки.ШК;
	новая_строка.КодПокупки			= параметрыПосылки.Коробка.Код;
	
	//Умолчания						= аСПНаСервере.ПолучитьЗначенияПоУмолчанию(параметрыПосылки.ПунктВыдачи,Ложь);
	//Если Константы.ВыбиратьГабаритПоТОчкеНазначения.Получить() и 
	//	параметрыПосылки.ПунктВыдачи <> Объект.СвояТочка   Тогда
	//	новая_строка.Габарит		= ?(ЗначениеЗаполнено(Умолчания.Габарит),		Умолчания.Габарит,			Габарит);
	//	новая_строка.МестоХранения	= ?(ЗначениеЗаполнено(Умолчания.МестоХранения),	Умолчания.МестоХранения,	МестоХранения);
	//Иначе	
		новая_строка.Габарит		= Габарит;
		новая_строка.МестоХранения	= МестоХранения;
	//КонецЕсли;		
	
	Возврат Истина;
КонецФункции

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура Добавить(Команда)
	ШК_Строка	=	СП_Штрихкоды.ПолучитьШтрихКод(Покупка,Участник,?(Объект.Транзит, Объект.ПунктВыдачи, Объект.СвояТочка));
	ОбработатьШКнаКлиенте(ШК_Строка);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоКодуПосылки(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораПосылкиПоКодуПосылки",,ЭтотОбъект,,,,Новый ОписаниеОповещения("ДобавитьПоПокупкеУчастнику_Завершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьПоШтрихКоду(Команда)
	ОбработатьШКнаКлиенте(ШтрихКод);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоПокупкеУчастнику(Команда)
	ОткрытьФорму("ОбщаяФорма.ВыборПосылкиПоПокупкеУчастнику",,ЭтотОбъект,,,,Новый ОписаниеОповещения("ДобавитьПоПокупкеУчастнику_Завершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоПокупкеУчастнику_Завершение(ШК, ДополнительныеПараметры) Экспорт
	//Добавлено в ЕДТ
	Если ШК<>неопределено Тогда
		ДобавитьПосылку(ШК);
	КонецЕсли;		
КонецПроцедуры	


&НаКлиенте
Процедура ПоменятьПолку(Команда)
	Если Объект.Проведен Тогда
		Сообщить("Нельзя поменять место хранения . Документ уже проведен");
	Иначе	
		для н=0 по  Элементы.Покупки.ВыделенныеСтроки.Количество()-1 цикл
			Объект.Покупки[Элементы.Покупки.ВыделенныеСтроки[н]].МестоХранения    =ЭтаФорма.МестоХранения;
		конецЦикла;
		для н=0 по  Элементы.Посылки.ВыделенныеСтроки.Количество()-1 цикл
			Объект.Посылки[Элементы.Посылки.ВыделенныеСтроки[н]].МестоХранения    =ЭтаФорма.МестоХранения;
		конецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоменятьГабарит(Команда)
	Если Объект.Проведен Тогда
		Сообщить("Нельзя поменять Габарит . Документ уже проведен");
	Иначе	
		для н=0 по Элементы.Покупки.ВыделенныеСтроки.Количество()-1 цикл
			Объект.Покупки[Элементы.Покупки.ВыделенныеСтроки[н]].Габарит    =ЭтаФорма.Габарит;

		конецЦикла;	
		для н=0 по Элементы.Посылки.ВыделенныеСтроки.Количество()-1 цикл
			Объект.Посылки[Элементы.Посылки.ВыделенныеСтроки[н]].Габарит    =ЭтаФорма.Габарит;
		конецЦикла;	
	КонецЕсли;
КонецПроцедуры



#КонецОбласти

#Область Вспомогательные

&НаКлиенте
Процедура ПроверитьПунктВыдачиИДобавитьЗаказ(ДанныеШК)
	ПВКорректен	= Истина;
	//12000024348002000036
	Если Строка(ДанныеШК.ПунктВыдачи) = "Пунт выдачи не указан" Тогда
		ТекстВопроса	= "Пункт выдачи не указан";		
				
		ПВКорректен	= Ложь ;
	КонецЕсли;
	Если		Объект.Транзит 					 и  
		    не (ДанныеШК.ПунктВыдачи = Объект.ПунктВыдачи или
			
				НеПроверятьТочку) 			Тогда 
		ТекстВопроса	= "Пункт выдачи заказа:"+ДанныеШК.ПунктВыдачи+" не совпадает с пунктом выдачи документа:"+Объект.ПунктВыдачи+". ";		
				
		ПВКорректен	= Ложь ;
	ИначеЕсли 	не Объект.Транзит и 
				не (ДанныеШК.ПунктВыдачи = Объект.СвояТочка)  Тогда
		ТекстВопроса	= "Заказ предназначен для пункта выдачи:"+ ДанныеШК.ПунктВыдачи+ ". ";		
		ПВКорректен	= Ложь;
		
	КонецЕсли;	
	Если ПВКорректен = Ложь Тогда
		параметрыФормы = новый Структура;
		Если ДанныеШК.Свойство("Посылка") Тогда
			Заказ = ДанныеШК.Посылка;
		ИначеЕсли ДанныеШК.Свойство("Коробка") Тогда
			Заказ = ДанныеШК.Коробка;
		Иначе	
			Заказ = Неопределено;
		КонецЕсли;	
		параметрыФормы.Вставить("Посылка", 		   			Заказ); 
		параметрыФормы.Вставить("ДокументПоступления", 		Объект.Ссылка);               
		параметрыФормы.Вставить("ПунктВыдачиНаСтикере", 	ДанныеШК.ПунктВыдачи);
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ДанныеШК",ДанныеШК);
		ДопПараметры.Вставить("ПВКорректен",ПВКорректен);
		ДопПараметры.Вставить("ТекстВопроса",ТекстВопроса);
		
		Оповещение = Новый ОписаниеОповещения("ПроверитьПунктВыдачиИДобавитьЗаказЗавершение",ЭтотОбъект ,ДопПараметры);
		ОткрытьФорму("ОбщаяФорма.ФормаВыбораПунктаВыдачи",параметрыФормы ,ЭтотОбъект , , , , Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца );
//		
//		               
//		Результат = ОткрытьФормуМодально("ОбщаяФорма.ФормаВыбораПунктаВыдачи", 	параметрыФормы ,ЭтаФорма);
//		ДанныеШК.ПунктВыдачи = Результат;
//		ПВКорректен = Истина;
	Иначе
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ДанныеШК",ДанныеШК);
		ДопПараметры.Вставить("ПВКорректен",ПВКорректен);
		ДопПараметры.Вставить("ТекстВопроса","");
		ПроверитьПунктВыдачиИДобавитьЗаказЗавершение(ДанныеШК.ПунктВыдачи, ДопПараметры)
	КонецЕсли;
	
//	Если не ОткрытДиалогВопроса Тогда
//		Если не ПВКорректен Тогда
//			ОткрытДиалогВопроса = Истина;
//			ПоказатьВопрос(новый ОписаниеОповещения("ДобавитьЗаказ", ЭтотОбъект, ДанныеШК), ТекстВопроса
//				+ "Все равно добавить?", РежимДиалогаВопрос.ДаНет);
//		Иначе
//			ДобавитьЗаказ(КодВозвратаДиалога.Да, ДанныеШК)
//		КонецЕсли;
//	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ПроверитьПунктВыдачиИДобавитьЗаказЗавершение(Результат, ДопПараметры) Экспорт
	ДанныеШК = ДопПараметры.ДанныеШК;
	Если не ДопПараметры.ПВКорректен Тогда
		ДанныеШК.ПунктВыдачи = Результат;
		ПоказатьВопрос(новый ОписаниеОповещения("ДобавитьЗаказ", ЭтотОбъект, ДанныеШК), ДопПараметры.ТекстВопроса
			+ "Все равно добавить?", РежимДиалогаВопрос.ДаНет);
		
	Иначе	
		ДобавитьЗаказ(КодВозвратаДиалога.Да, ДанныеШК);
	КонецЕсли	
	
КонецПроцедуры	


&НаКлиенте
Процедура ДобавитьЗаказ(Результат, ДанныеШК) Экспорт
	
	Если Результат =  КодВозвратаДиалога.Нет Тогда
		ОткрытДиалогВопроса = Ложь; 
		Возврат; 
	КонецЕсли;
	
	Если Строка(ДанныеШК.Тип) = "Посылка (12)" Тогда
			ПсылкаДобавлена = ДобавитьПосылку(ДанныеШК);
			Если ПсылкаДобавлена Тогда
				СтоСП_Клиент.СигналДинамика();
			КонецЕсли;
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.группаПосылки;
	ИначеЕсли Строка(ДанныеШК.Тип) = "Покупка (11)"
			или Строка(ДанныеШК.Тип) = "Заказ100маркета (33)" Тогда //11043940487532000904	
			ЗаказДобавлен = ДобавитьСтарыйЗаказ(ДанныеШК);
			Если ЗаказДобавлен Тогда
				СтоСП_Клиент.СигналДинамика();
			КОнецЕсли;
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.группаПокупки;
	ИначеЕсли Строка(ДанныеШК.Тип) = "Коробка (44)" Тогда //44352952000899132115000954   44017898000522752026005685
			ЗаказДобавлен = ДобавитьГруппу(ДанныеШК);
			Если ЗаказДобавлен Тогда
				СтоСП_Клиент.СигналДинамика();
			КОнецЕсли;
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.группаПокупки;
	ИначеЕсли Строка(ДанныеШК.Тип) = "Заказ КД (45)" Тогда //44352952000899132115000954   44017898000522752026005685
			ЗаказДобавлен = ДобавитьЗаказКД(ДанныеШК);
			Если ЗаказДобавлен Тогда
				СтоСП_Клиент.СигналДинамика();
			КОнецЕсли;
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.группаПокупки;
	КонецЕсли;
//	ОткрытДиалогВопроса = Ложь;
КонецПроцедуры

//Не испротзуется висит для примера
&НаСервере
Процедура ПодсветкаСтрок()

    ЭтаФорма.УсловноеОформление.Элементы.Очистить();
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Покупки");
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Покупки.Предупреждение");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.ПредупрежденияПрихода.Дубль;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЗолотистый);	
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Покупки");
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Покупки.Предупреждение");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.ПредупрежденияПрихода.ЧерныйСписок;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоСерый);	
	
КонецПроцедуры


Процедура УстановитьВидимость()
	Элементы.грТранзит.Видимость			= Объект.Транзит и не Объект.МультиОрг;
	Элементы.ЗаказыОрганизатор.Видимость	= Объект.Транзит или Объект.МультиОрг;
	Элементы.грПриход.Видимость				= не (Объект.Транзит или Объект.МультиОрг);
	
	
	//Элементы.гпВесОбъем.Видимость			= ГабвритПараметры.НеГабарит;
	Элементы.Дата.ТолькоПросмотр			= не РольДоступна("ПолныеПрава");
	
	Элементы.ОргСбор.Видимость				= Константы.ФлагОрганизаторОплачиваетРазборДоступность.Получить();
	Элементы.ПокупкиОргСбор.Видимость		= Элементы.ОргСбор.Видимость;
	
	Если Объект.Покупки.Количество()=0 Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница=Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.группаПосылки;
	Конецесли;
	Элементы.НеПриниматьТранзит.Заголовок = ?(НеПриниматьТранзит, "нельзя принимать транзит", "можно принимать транзит");	
	
	//всегоПокупок = Объект.Покупки.Количество();
	//Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.группаПокупки.Заголовок=?(всегоПокупок=0,"Покупки","Покупки ("+всегоПокупок+")");
	//
	//всегоПосылок = Объект.Посылки.Количество();
	//Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.группаПосылки.Заголовок=?(всегоПосылок=0,"Посылки","Посылки ("+всегоПосылок+")");
	//Элементы.НеПриниматьТранзит.Заголовок = ?(НеПриниматьТранзит, "нельзя принимать транзит", "можно принимать транзит");
	
КонецПроцедуры	


Функция ПересчетЗаголовковСтраниц()
	всегоПокупок = Объект.Покупки.Количество();
	Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.группаПокупки.Заголовок=?(всегоПокупок=0,"Покупки","Покупки ("+всегоПокупок+")");
	
	всегоПосылок = Объект.Посылки.Количество();
	Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.группаПосылки.Заголовок=?(всегоПосылок=0,"Посылки","Посылки ("+всегоПосылок+")");

	
	всегоОТ = Объект.ОборотнаяТара.Количество();
	Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаОборотнаяТара.Заголовок=?(всегоПосылок=0,"оборотная тара","оборотная тара ("+всегоОТ+")");
	
	
КонецФункции


#КонецОбласти


#Область ОбменДанными

&НаСервере
Функция  ПросмотрXMLНаСервере()
	
	об=ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.Приходная"));
	Возврат СтоСПОбмен_Запрос.ВыгрузкаПоступлений_income(об);
КонецФункции

&НаКлиенте
Процедура ПросмотрXML(Команда)
	Если Модифицированность Тогда
		Записать(новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись));
	КонецЕсли;
	хмл_incomes=ПросмотрXMLНаСервере();
	СтоСП_Клиент.Показать_XML(хмл_incomes);
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрПолученногоXML(Команда)
	Если Элементы.Протокол.ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(,"Не выбран элемент)");
	Иначе
		хмл_incomes = Элементы.Протокол.ТекущиеДанные.ПолученныеДанные;
		СтоСП_Клиент.Показать_XML(хмл_incomes);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура Отправить(Команда)
	Если Модифицированность Тогда
		Записать(новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись));
	КонецЕсли;	
	ОтправитьНаСервере();
	Для каждого пос из Объект.Посылки Цикл
		Если пос.Отправлено Тогда
			ОповеститьОбИзменении(пос.Посылка);
		Конецесли;
	КонецЦикла	
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()
	об	=	ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.Приходная"));
	об.ВыгрузитьНаСайт();
	ЗначениеВДанныеФормы(об,Объект);
КонецПроцедуры

#КонецОбласти


#Область СобытияФормы


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
КонецПроцедуры



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СП_РаботаСДокументами.ПриСозданииНаСервере(ЭтотОбъект);	
    Элементы.Оплачен.Видимость = Константы.ИспользоватьПризнакОплаты.Получить();
	
	Если Параметры.Свойство("ПунктВыдачи") Тогда
		Объект.ПунктВыдачи = Параметры.ПунктВыдачи;
	КонецЕсли;	
	Если Параметры.Свойство("Транзит") Тогда
		Объект.Транзит = Параметры.Транзит;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаблокироватьДанныеФормыДляРедактирования();
	КонецЕсли;	
	
	
	
	Умолчания		= аСПНаСервере.ПолучитьЗначенияПоУмолчанию(Объект.ПунктВыдачи);
	Габарит			= Умолчания.Габарит;
	МестоХранения	= Умолчания.МестоХранения;
	
	НеПриниматьТранзит = Константы.НеПриниматьТранзит.Получить();
	КонтролироватьПунктыВыдачи 		= Константы.КонтролироватьПунктыВыдачи.Получить();
	Объект.ДелаемГрупповойСтикер	= Константы.ДелаемГруупповойСтикер.Получить();

	Покупка=справочники.Покупки.ПустаяСсылка();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОткрытДиалогВопроса = Ложь;
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	СП_РаботаСДокументами_Клиент.ПриОткрытии(ЭтотОбъект);
	 
	ОтдельнымМестом = Истина;
	Умолчания		= аСПНаСервере.ПолучитьЗначенияПоУмолчанию(Объект.ПунктВыдачи);
	Габарит			= Умолчания.Габарит;
	МестоХранения	= Умолчания.МестоХранения;
	
	ПодсветкаСтрок();
	
	//Сканер штрихкода
   СтоСП_Клиент.ПодключитьСканерШК(УникальныйИдентификатор);

	
	Оплачен=Истина;	
	УстановитьВидимость();
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Дата=ТекущаяДата();	
	КонецЕсли;	
	
	Результат = ПроверитьОшибкиГрупп();
	Если Результат.ЕстьОшибки и не Объект.ИгнорироватьПредупреждения Тогда
		СтоСП_Клиент.СигналДинамика();
		СтоСП_Клиент.СигналДинамика();
		СтоСП_Клиент.СигналДинамика();
		ПоказатьПредупреждение(,Результат.ТекстСообщения );
		Отказ = Истина;	
	КонецЕсли;
КонецПроцедуры

Функция ПроверитьОшибкиГрупп()
	естьОшибки = ложь;
	ТекстСообщения = "";
	Для каждого элем из Объект.Покупки Цикл
		Если 	ТипЗнч(элем.покупка) = Тип("СправочникСсылка.Коробки") и 
			элем.покупка.ТочкаНазначения <> Объект.ПунктВыдачи			Тогда
			ТекстСообщения = ТекстСообщения + "В строке "+элем.НомерСтроки+" ПВ группы: " + элем.покупка.ТочкаНазначения+
			" отличается от ПВ документа: " + Объект.ПунктВыдачи + Символы.ПС;
			естьОшибки = Истина;
		КонецЕсли;		
	КонецЦикла;
	Для каждого элем из Объект.Посылки Цикл
		Если 	элем.Посылка.ПунктВыдачи <> Объект.ПунктВыдачи	и 
			    Объект.ПунктВыдачи <> Справочники.ТочкиРаздачи.ПунтВыдачиНеУказан Тогда
			ТекстСообщения = ТекстСообщения + "В строке "+элем.НомерСтроки+" ПВ посылки: " + элем.Посылка.ПунктВыдачи +
			" отличается от ПВ документа: " + Объект.ПунктВыдачи+Символы.ПС;
			естьОшибки = Истина;
		КонецЕсли;		
	КонецЦикла;
	возврат Новый Структура("естьОшибки, ТекстСообщения",естьОшибки, ТекстСообщения);
КонецФункции	


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.Проведен и  (ПараметрыЗаписи.РежимЗаписи=РежимЗаписиДокумента.Проведение или ПараметрыЗаписи.РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения) Тогда
		Если Константы.ЗапретРедактированияПрихода.Получить() Тогда	
			Отказ=аСППрверки.ИспользуетсяВДвижениях(ТекущийОбъект.Ссылка);
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры



&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	РежимЗаписи	=	ПараметрыЗаписи;
КонецПроцедуры

Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если 	ПараметрыЗаписи 				<> 	Неопределено
			и ПараметрыЗаписи.РежимЗаписи 	= 	РежимЗаписиДокумента.Проведение Тогда

		парам = Новый Массив();
		парам.Добавить(Объект.Ссылка);

		ФоновыеЗадания.Выполнить("аспПроцедурыОбменаДанными.УдалитьДокументИзОтправленных", парам, , "УдалитьДокументИзОтправленных");

		Если Константы.ВыгружатьПриходПриЗаписи.Получить() Тогда
			Попытка
				ФоновыеЗадания.Выполнить("СтоСПФоновые.Запустить_Выгрузку_100СП", , 1, "Запустить_Выгрузку_100СП");
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры	


///////

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ГруппаСтраницыПриСменеСтраницыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ГруппаСтраницыПриСменеСтраницыНаСервере()
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница=Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаПротокол Тогда
		парамДок				= Протокол.Параметры.Элементы.Найти("Документ");
		парамДок.Значение		= Объект.Ссылка;
		парамДок.Использование	= Истина;
	Конецесли;	
КонецПроцедуры

&НаКлиенте
Процедура ТранзитПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура МультиОргПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ТочкаНазначенияПриИзменении(Элемент)
	Умолчания		= аСПНаСервере.ПолучитьЗначенияПоУмолчанию(Объект.ПунктВыдачи,ложь);
	Габарит			= ?(ЗначениеЗаполнено(Умолчания.Габарит),Умолчания.Габарит,Габарит);
	МестоХранения	= ?(ЗначениеЗаполнено(Умолчания.МестоХранения),Умолчания.МестоХранения,МестоХранения);
КонецПроцедуры

&НаКлиенте
Процедура ГабаритПриИзменении(Элемент)
	ГабвритПараметры =  СП_РаботаСДокументами.ГабаритПараметры(Габарит);
	Если ГабвритПараметры = Неопределено Тогда
		Габарит =Неопределено;
	ИначеЕсли ГабвритПараметры.Отменен Тогда	
		Габарит =Неопределено;
	ИначеЕсли ГабвритПараметры.ЛимитПревышен Тогда
		ТекстСообщения = "Принято максимальное количество заказов по габариту "+ Габарит +" , "+ГабвритПараметры.Лимит +"шт";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Габарит =Неопределено;
		
	КонецЕсли;	
	УстановитьВидимость();
	Вес		= 0;
	объем	= 0;
КонецПроцедуры

&НаКлиенте
Процедура ПокупкиПосылкиПослеУдаления(Элемент)
	ПересчетЗаголовковСтраниц()
КонецПроцедуры


#КонецОбласти



// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаСервере
Процедура ПокупкиГабаритПриИзмененииНаСервере()
	Объект.Отправлено = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПокупкиГабаритПриИзменении(Элемент)
	ГабвритПараметры =  СП_РаботаСДокументами.ГабаритПараметры(Элементы.Посылки.ТекущиеДанные.Габарит);
	Если ГабвритПараметры = Неопределено Тогда
		Элементы.Посылки.ТекущиеДанные.Габарит =Неопределено;
	ИначеЕсли ГабвритПараметры.Отменен Тогда	
		Элементы.Посылки.ТекущиеДанные.Габарит =Неопределено;
	ИначеЕсли ГабвритПараметры.ЛимитПревышен Тогда
		ТекстСообщения = "Принято максимальное количество заказов по габариту "+ Элементы.Посылки.ТекущиеДанные.Габарит +" , "+ГабвритПараметры.Лимит +"шт";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Элементы.Посылки.ТекущиеДанные.Габарит =Неопределено;
		
	КонецЕсли;	
	
	
	ПокупкиГабаритПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПосылкиГабаритПриИзменении(Элемент)
	Объект.Отправлено = Ложь;
	Элементы.Посылки.ТекущиеДанные.отправлено = Ложь;
	ГабвритПараметры =  СП_РаботаСДокументами.ГабаритПараметры(Элементы.Посылки.ТекущиеДанные.Габарит);
	Если ГабвритПараметры = Неопределено Тогда
		Элементы.Посылки.ТекущиеДанные.Габарит =Неопределено;
	ИначеЕсли ГабвритПараметры.Отменен Тогда	
		Элементы.Посылки.ТекущиеДанные.Габарит =Неопределено;
	ИначеЕсли ГабвритПараметры.ЛимитПревышен Тогда
		ТекстСообщения = "Принято максимальное количество заказов по габариту "+ Элементы.Посылки.ТекущиеДанные.Габарит +" , "+ГабвритПараметры.Лимит +"шт";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Элементы.Посылки.ТекущиеДанные.Габарит =Неопределено;

	КонецЕсли;	
	

КонецПроцедуры

&НаКлиенте
Процедура НеПриниматьТранзит(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаОжиданиеВводаШтрихкода",,ЭтотОбъект,,,,Новый ОписаниеОповещения("ВвестиШтрихКодАдминистратора_Завершение", ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ВвестиШтрихКодАдминистратора_Завершение(ШК, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(ШК) =  Тип("Структура") и
		 ШК.Свойство("Администратор")	и
		 ШК.Администратор         			Тогда
		 НеПриниматьТранзит = не НеПриниматьТранзит;
	 КонецЕсли;	 
	 УстановитьВидимость();
КонецПроцедуры	

&НаКлиенте
Процедура ОборотнаяТараПриИзменении(Элемент)
	ПересчетЗаголовковСтраниц();
КонецПроцедуры

&НаКлиенте
Процедура ОборотнаяТараПослеУдаления(Элемент)
	ПересчетЗаголовковСтраниц();
КонецПроцедуры

&НаКлиенте
Процедура ПосылкиПриИзменении(Элемент)
	ПересчетЗаголовковСтраниц();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)  
	списокГабаритов = Новый СписокЗначений;
	тзГабариты = Объект.Посылки.Выгрузить(, "Габарит");
	тзГабариты.Свернуть("Габарит");
	списокГабаритов.ЗагрузитьЗначения(тзГабариты.ВыгрузитьКолонку("Габарит"));
	
	результатГабариты = СП_РаботаСДокументами.ГабаритыНегабориты(списокГабаритов,?(ЗначениеЗаполнено(объект.Ссылка), объект.Ссылка.МоментВремени(), ТекущаяДата()));
	
	выборкаГабариты = результатГабариты.выбрать();
	
	Пока выборкаГабариты.следующий() Цикл
		массСтрок = Объект.Посылки.НайтиСтроки(новый Структура("Вес, Объем,Габарит", 0,0,выборкаГабариты.Габарит));		
		Для каждого элем  из массСтрок Цикл
			Отказ = истина; 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке "+элем.Номерстроки + " не укзан вес, объем для  негаборитного товара. ("+
																"п: "+элем.Посылка+")",,"Объект.Посылки["+(элем.НомерСтроки - 1)+"].Вес");
			
		КонецЦикла	;
		
	КонецЦикла;		
	
	

КонецПроцедуры


// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
